## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                       NAME                        |
|--------|---------------------------------------------------|
| add    | `aws_iam_policy.s3_access_policy`                 |
|        | `aws_iam_role_policy_attachment.s3_access_policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.s3_access_policy will be created
  + resource "aws_iam_policy" "s3_access_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ai-answers to access S3"
      + id               = (known after apply)
      + name             = "ai-answers-s3-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::mock-bucket/*",
                          + "arn:aws:s3:::mock-bucket",
                        ]
                      + Sid      = "AllowS3Access"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "CostCentre" = "ai-answers-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role_policy_attachment.s3_access_policy will be created
  + resource "aws_iam_role_policy_attachment" "s3_access_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ai-answers-ecs-role"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.s3_access_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.ai-answers-ecs-role"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
